mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
/****************************************************************************
 * drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
 *
 * Minimal WPA2-PSK 4-way handshake for the nRF7002 driver.
 *
 * Implements:
 *   - SHA-1 (from OpenBSD / public domain)
 *   - HMAC-SHA1
 *   - PBKDF2-SHA1  (PMK derivation)
 *   - PRF-512       (PTK derivation)
 *   - AES-128 key-unwrap (GTK extraction from M3)
 *   - EAPOL-Key frame parser / 4-way HS state machine
 *
 * References:
 *   IEEE 802.11-2020, Clause 12.7.6 (4-way HS)
 *   RFC 2898 (PBKDF2)
 *   RFC 3394 (AES Key Wrap)
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <syslog.h>
#include <arpa/inet.h>

#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>

#include "nrf7002_wpa.h"
#include "nrf7002_driver.h"

/* FMAC API for key installation and data TX */

#include "system/fmac_api.h"
#include "system/fmac_peer.h"
#include "common/fmac_util.h"
#include "host_rpu_umac_if.h"
#include "osal_api.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define SHA1_DIGEST_LEN  20
#define SHA1_BLOCK_LEN   64
#define AES_BLOCK_LEN    16
#define PMK_LEN          32
#define PTK_LEN          64  /* 512 bits */

#define EAPOL_ETHERTYPE  0x888e

/* Zephyr's net_pkt_to_nbuf() reserves 100 bytes before handing EAPOL/data
 * frames to nrf_wifi_fmac_start_xmit().  Keep the same shape for the
 * hand-written control-port frames.
 */

#define NRF7002_TX_NBUF_HEADROOM 100

/* EAPOL-Key descriptor type (WPA/RSN = 2) */

#define EAPOL_KEY_DESC_RSN  2

/* Key Information flags (byte 0 of 2-byte big-endian field) */

#define EAPOL_KI_MIC     0x01  /* bit 8 */
#define EAPOL_KI_SECURE  0x02  /* bit 9 */
#define EAPOL_KI_ENCDATA 0x10  /* bit 12 = Encrypted Key Data */
#define EAPOL_KI_PAIRWISE 0x08 /* bit 3 of lo byte = key type (pairwise=1) */

/****************************************************************************
 * Private Types — SHA-1
 * Steve Reid's public domain SHA-1
 ****************************************************************************/

typedef struct
{
  uint32_t state[5];
  uint32_t count[2];
  uint8_t  buf[64];
} sha1_ctx_t;

/****************************************************************************
 * Private Functions — SHA-1
 ****************************************************************************/

#define SHA1_ROL(x, n)  (((x) << (n)) | ((x) >> (32 - (n))))

#define SHA1_BLK0(i) (W[i] = (((uint32_t)(buf[4*(i)])   << 24) | \
                               ((uint32_t)(buf[4*(i)+1]) << 16) | \
                               ((uint32_t)(buf[4*(i)+2]) <<  8) | \
                                (uint32_t)(buf[4*(i)+3])))

#define SHA1_BLK(i) (W[(i)&15] = SHA1_ROL(W[((i)+13)&15] ^ W[((i)+8)&15] ^ \
                                            W[((i)+2)&15]  ^ W[(i)&15],1))

#define SHA1_R0(v,w,x,y,z,i) \
  z += ((w & (x ^ y)) ^ y)        + SHA1_BLK0(i) + 0x5a827999 + SHA1_ROL(v,5); \
  w = SHA1_ROL(w, 30)

#define SHA1_R1(v,w,x,y,z,i) \
  z += ((w & (x ^ y)) ^ y)        + SHA1_BLK(i)  + 0x5a827999 + SHA1_ROL(v,5); \
  w = SHA1_ROL(w, 30)

#define SHA1_R2(v,w,x,y,z,i) \
  z += (w ^ x ^ y)                 + SHA1_BLK(i)  + 0x6ed9eba1 + SHA1_ROL(v,5); \
  w = SHA1_ROL(w, 30)

#define SHA1_R3(v,w,x,y,z,i) \
  z += (((w | x) & y) | (w & x))   + SHA1_BLK(i)  + 0x8f1bbcdc + SHA1_ROL(v,5); \
  w = SHA1_ROL(w, 30)

#define SHA1_R4(v,w,x,y,z,i) \
  z += (w ^ x ^ y)                 + SHA1_BLK(i)  + 0xca62c1d6 + SHA1_ROL(v,5); \
  w = SHA1_ROL(w, 30)

static void sha1_transform(uint32_t state[5], const uint8_t buf[64])
{
  uint32_t W[16];
  uint32_t a = state[0];
  uint32_t b = state[1];
  uint32_t c = state[2];
  uint32_t d = state[3];
  uint32_t e = state[4];

  SHA1_R0(a,b,c,d,e, 0); SHA1_R0(e,a,b,c,d, 1); SHA1_R0(d,e,a,b,c, 2); SHA1_R0(c,d,e,a,b, 3);
  SHA1_R0(b,c,d,e,a, 4); SHA1_R0(a,b,c,d,e, 5); SHA1_R0(e,a,b,c,d, 6); SHA1_R0(d,e,a,b,c, 7);
  SHA1_R0(c,d,e,a,b, 8); SHA1_R0(b,c,d,e,a, 9); SHA1_R0(a,b,c,d,e,10); SHA1_R0(e,a,b,c,d,11);
  SHA1_R0(d,e,a,b,c,12); SHA1_R0(c,d,e,a,b,13); SHA1_R0(b,c,d,e,a,14); SHA1_R0(a,b,c,d,e,15);
  SHA1_R1(e,a,b,c,d,16); SHA1_R1(d,e,a,b,c,17); SHA1_R1(c,d,e,a,b,18); SHA1_R1(b,c,d,e,a,19);
  SHA1_R2(a,b,c,d,e,20); SHA1_R2(e,a,b,c,d,21); SHA1_R2(d,e,a,b,c,22); SHA1_R2(c,d,e,a,b,23);
  SHA1_R2(b,c,d,e,a,24); SHA1_R2(a,b,c,d,e,25); SHA1_R2(e,a,b,c,d,26); SHA1_R2(d,e,a,b,c,27);
  SHA1_R2(c,d,e,a,b,28); SHA1_R2(b,c,d,e,a,29); SHA1_R2(a,b,c,d,e,30); SHA1_R2(e,a,b,c,d,31);
  SHA1_R2(d,e,a,b,c,32); SHA1_R2(c,d,e,a,b,33); SHA1_R2(b,c,d,e,a,34); SHA1_R2(a,b,c,d,e,35);
  SHA1_R2(e,a,b,c,d,36); SHA1_R2(d,e,a,b,c,37); SHA1_R2(c,d,e,a,b,38); SHA1_R2(b,c,d,e,a,39);
  SHA1_R3(a,b,c,d,e,40); SHA1_R3(e,a,b,c,d,41); SHA1_R3(d,e,a,b,c,42); SHA1_R3(c,d,e,a,b,43);
  SHA1_R3(b,c,d,e,a,44); SHA1_R3(a,b,c,d,e,45); SHA1_R3(e,a,b,c,d,46); SHA1_R3(d,e,a,b,c,47);
  SHA1_R3(c,d,e,a,b,48); SHA1_R3(b,c,d,e,a,49); SHA1_R3(a,b,c,d,e,50); SHA1_R3(e,a,b,c,d,51);
  SHA1_R3(d,e,a,b,c,52); SHA1_R3(c,d,e,a,b,53); SHA1_R3(b,c,d,e,a,54); SHA1_R3(a,b,c,d,e,55);
  SHA1_R3(e,a,b,c,d,56); SHA1_R3(d,e,a,b,c,57); SHA1_R3(c,d,e,a,b,58); SHA1_R3(b,c,d,e,a,59);
  SHA1_R4(a,b,c,d,e,60); SHA1_R4(e,a,b,c,d,61); SHA1_R4(d,e,a,b,c,62); SHA1_R4(c,d,e,a,b,63);
  SHA1_R4(b,c,d,e,a,64); SHA1_R4(a,b,c,d,e,65); SHA1_R4(e,a,b,c,d,66); SHA1_R4(d,e,a,b,c,67);
  SHA1_R4(c,d,e,a,b,68); SHA1_R4(b,c,d,e,a,69); SHA1_R4(a,b,c,d,e,70); SHA1_R4(e,a,b,c,d,71);
  SHA1_R4(d,e,a,b,c,72); SHA1_R4(c,d,e,a,b,73); SHA1_R4(b,c,d,e,a,74); SHA1_R4(a,b,c,d,e,75);
  SHA1_R4(e,a,b,c,d,76); SHA1_R4(d,e,a,b,c,77); SHA1_R4(c,d,e,a,b,78); SHA1_R4(b,c,d,e,a,79);

  state[0] += a; state[1] += b; state[2] += c; state[3] += d; state[4] += e;
}

static void sha1_init(sha1_ctx_t *ctx)
{
  ctx->state[0] = 0x67452301;
  ctx->state[1] = 0xefcdab89;
  ctx->state[2] = 0x98badcfe;
  ctx->state[3] = 0x10325476;
  ctx->state[4] = 0xc3d2e1f0;
  ctx->count[0] = ctx->count[1] = 0;
}

static void sha1_update(sha1_ctx_t *ctx, const uint8_t *data, uint32_t len)
{
  uint32_t i;
  uint32_t j = (ctx->count[0] >> 3) & 63;

  if ((ctx->count[0] += len << 3) < (len << 3))
    {
      ctx->count[1]++;
    }

  ctx->count[1] += (len >> 29);

  if ((j + len) > 63)
    {
      i = 64 - j;
      memcpy(&ctx->buf[j], data, i);
      sha1_transform(ctx->state, ctx->buf);
      for (; i + 63 < len; i += 64)
        {
          sha1_transform(ctx->state, data + i);
        }
      j = 0;
    }
  else
    {
      i = 0;
    }

  memcpy(&ctx->buf[j], &data[i], len - i);
}

static void sha1_final(sha1_ctx_t *ctx, uint8_t digest[20])
{
  uint8_t finalcount[8];
  uint8_t c;
  int     i;

