mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
  for (i = 0; i < 8; i++)
    {
      finalcount[i] = (uint8_t)((ctx->count[(i >= 4 ? 0 : 1)]
                        >> ((3 - (i & 3)) * 8)) & 255);
    }

  c = 0x80;
  sha1_update(ctx, &c, 1);
  while ((ctx->count[0] & 504) != 448)
    {
      c = 0x00;
      sha1_update(ctx, &c, 1);
    }

  sha1_update(ctx, finalcount, 8);

  for (i = 0; i < 20; i++)
    {
      digest[i] = (uint8_t)((ctx->state[i >> 2] >> ((3 - (i & 3)) * 8)) & 255);
    }

  memset(ctx, 0, sizeof(*ctx));
}

static void sha1(const uint8_t *data, uint32_t len, uint8_t digest[20])
{
  sha1_ctx_t ctx;
  sha1_init(&ctx);
  sha1_update(&ctx, data, len);
  sha1_final(&ctx, digest);
}

/****************************************************************************
 * Private Functions — HMAC-SHA1
 ****************************************************************************/

static void hmac_sha1(const uint8_t *key, uint32_t klen,
                      const uint8_t *data, uint32_t dlen,
                      uint8_t digest[20])
{
  sha1_ctx_t ctx;
  uint8_t    k_pad[64];
  uint8_t    tk[20];
  int        i;

  if (klen > 64)
    {
      sha1(key, klen, tk);
      key  = tk;
      klen = 20;
    }

  memset(k_pad, 0x36, 64);
  for (i = 0; i < (int)klen; i++)
    {
      k_pad[i] ^= key[i];
    }

  sha1_init(&ctx);
  sha1_update(&ctx, k_pad, 64);
  sha1_update(&ctx, data, dlen);
  sha1_final(&ctx, digest);

  memset(k_pad, 0x5c, 64);
  for (i = 0; i < (int)klen; i++)
    {
      k_pad[i] ^= key[i];
    }

  sha1_init(&ctx);
  sha1_update(&ctx, k_pad, 64);
  sha1_update(&ctx, digest, 20);
  sha1_final(&ctx, digest);
}

/* HMAC-SHA1 over multiple scatter/gather data segments */

static void hmac_sha1_vector(const uint8_t *key, uint32_t klen,
                              int num_elem,
                              const uint8_t * const *data,
                              const uint32_t *data_len,
                              uint8_t digest[20])
{
  sha1_ctx_t ctx;
  sha1_ctx_t ctx2;
  uint8_t    k_pad[64];
  uint8_t    tk[20];
  int        i;

  if (klen > 64)
    {
      sha1(key, klen, tk);
      key  = tk;
      klen = 20;
    }

  memset(k_pad, 0x36, 64);
  for (i = 0; i < (int)klen; i++)
    {
      k_pad[i] ^= key[i];
    }

  sha1_init(&ctx);
  sha1_update(&ctx, k_pad, 64);
  for (i = 0; i < num_elem; i++)
    {
      sha1_update(&ctx, data[i], data_len[i]);
    }

  sha1_final(&ctx, digest);

  memset(k_pad, 0x5c, 64);
  for (i = 0; i < (int)klen; i++)
    {
      k_pad[i] ^= key[i];
    }

  sha1_init(&ctx2);
  sha1_update(&ctx2, k_pad, 64);
  sha1_update(&ctx2, digest, 20);
  sha1_final(&ctx2, digest);
}

/****************************************************************************
 * Private Functions — PBKDF2-SHA1
 * RFC 2898 §5.2
 ****************************************************************************/

static void pbkdf2_sha1(const char *passphrase,
                        const uint8_t *ssid, uint32_t ssid_len,
                        uint32_t iterations,
                        uint8_t *out, uint32_t out_len)
{
  uint32_t block;
  uint32_t bytes;
  uint32_t i;
  uint8_t  U[20];
  uint8_t  T[20];
  uint8_t  tmp[4];

  const uint8_t *pd[2];
  uint32_t       pl[2];

  pd[0] = ssid;
  pl[0] = ssid_len;
  pd[1] = tmp;
  pl[1] = 4;

  for (block = 1; out_len > 0; block++)
    {
      /* U1 = HMAC-SHA1(password, salt || INT(block)) */

      tmp[0] = (uint8_t)(block >> 24);
      tmp[1] = (uint8_t)(block >> 16);
      tmp[2] = (uint8_t)(block >>  8);
      tmp[3] = (uint8_t)(block);

      hmac_sha1_vector((const uint8_t *)passphrase, strlen(passphrase),
                       2, pd, pl, U);
      memcpy(T, U, 20);

      /* U2..Un = HMAC-SHA1(password, U_{n-1}) */

      for (i = 1; i < iterations; i++)
        {
          hmac_sha1((const uint8_t *)passphrase, strlen(passphrase),
                    U, 20, U);
          for (int j = 0; j < 20; j++)
            {
              T[j] ^= U[j];
            }
        }

      bytes = (out_len < 20) ? out_len : 20;
      memcpy(out, T, bytes);
      out     += bytes;
      out_len -= bytes;
    }
}

/****************************************************************************
 * Private Functions — IEEE 802.11 PRF
 * PRF(key, A, B, len_bits)
 *   for i = 0; i < ⌈len/160⌉; i++:
 *     H = HMAC-SHA1(key, A || 0x00 || B || i)
 *     output = output || H
 ****************************************************************************/

static void prf(const uint8_t *key,   uint32_t klen,
                const char    *label, uint32_t llen,
                const uint8_t *data,  uint32_t dlen,
                uint8_t       *out,   uint32_t out_bytes)
{
  uint8_t        counter = 0;
  uint8_t        digest[20];
  uint32_t       done = 0;
  uint8_t        zero = 0;
  const uint8_t *segs[4];
  uint32_t       lens[4];

  segs[0] = (const uint8_t *)label;
  lens[0] = llen;
  segs[1] = &zero;
  lens[1] = 1;
  segs[2] = data;
  lens[2] = dlen;
  segs[3] = &counter;
  lens[3] = 1;

  while (done < out_bytes)
    {
      hmac_sha1_vector(key, klen, 4, segs, lens, digest);
      uint32_t copy = (out_bytes - done < 20) ? (out_bytes - done) : 20;
      memcpy(out + done, digest, copy);
      done += copy;
      counter++;
    }
}

/****************************************************************************
 * Private Functions — AES-128 (for key unwrap)
 * Tiny AES from Kokke (public domain)
 ****************************************************************************/

#define NB 4
#define NK 4
#define NR 10

typedef uint8_t state_t[4][4];

static const uint8_t sbox[256] =
{
  0x63,0x7c,0x77,0x7b,0xf2,0x6b,0x6f,0xc5,0x30,0x01,0x67,0x2b,0xfe,0xd7,0xab,0x76,
  0xca,0x82,0xc9,0x7d,0xfa,0x59,0x47,0xf0,0xad,0xd4,0xa2,0xaf,0x9c,0xa4,0x72,0xc0,
  0xb7,0xfd,0x93,0x26,0x36,0x3f,0xf7,0xcc,0x34,0xa5,0xe5,0xf1,0x71,0xd8,0x31,0x15,
  0x04,0xc7,0x23,0xc3,0x18,0x96,0x05,0x9a,0x07,0x12,0x80,0xe2,0xeb,0x27,0xb2,0x75,
  0x09,0x83,0x2c,0x1a,0x1b,0x6e,0x5a,0xa0,0x52,0x3b,0xd6,0xb3,0x29,0xe3,0x2f,0x84,
  0x53,0xd1,0x00,0xed,0x20,0xfc,0xb1,0x5b,0x6a,0xcb,0xbe,0x39,0x4a,0x4c,0x58,0xcf,
  0xd0,0xef,0xaa,0xfb,0x43,0x4d,0x33,0x85,0x45,0xf9,0x02,0x7f,0x50,0x3c,0x9f,0xa8,
  0x51,0xa3,0x40,0x8f,0x92,0x9d,0x38,0xf5,0xbc,0xb6,0xda,0x21,0x10,0xff,0xf3,0xd2,
  0xcd,0x0c,0x13,0xec,0x5f,0x97,0x44,0x17,0xc4,0xa7,0x7e,0x3d,0x64,0x5d,0x19,0x73,
  0x60,0x81,0x4f,0xdc,0x22,0x2a,0x90,0x88,0x46,0xee,0xb8,0x14,0xde,0x5e,0x0b,0xdb,
  0xe0,0x32,0x3a,0x0a,0x49,0x06,0x24,0x5c,0xc2,0xd3,0xac,0x62,0x91,0x95,0xe4,0x79,
  0xe7,0xc8,0x37,0x6d,0x8d,0xd5,0x4e,0xa9,0x6c,0x56,0xf4,0xea,0x65,0x7a,0xae,0x08,
  0xba,0x78,0x25,0x2e,0x1c,0xa6,0xb4,0xc6,0xe8,0xdd,0x74,0x1f,0x4b,0xbd,0x8b,0x8a,
  0x70,0x3e,0xb5,0x66,0x48,0x03,0xf6,0x0e,0x61,0x35,0x57,0xb9,0x86,0xc1,0x1d,0x9e,
  0xe1,0xf8,0x98,0x11,0x69,0xd9,0x8e,0x94,0x9b,0x1e,0x87,0xe9,0xce,0x55,0x28,0xdf,
  0x8c,0xa1,0x89,0x0d,0xbf,0xe6,0x42,0x68,0x41,0x99,0x2d,0x0f,0xb0,0x54,0xbb,0x16
};

