mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
static const uint8_t rsbox[256] =
{
  0x52,0x09,0x6a,0xd5,0x30,0x36,0xa5,0x38,0xbf,0x40,0xa3,0x9e,0x81,0xf3,0xd7,0xfb,
  0x7c,0xe3,0x39,0x82,0x9b,0x2f,0xff,0x87,0x34,0x8e,0x43,0x44,0xc4,0xde,0xe9,0xcb,
  0x54,0x7b,0x94,0x32,0xa6,0xc2,0x23,0x3d,0xee,0x4c,0x95,0x0b,0x42,0xfa,0xc3,0x4e,
  0x08,0x2e,0xa1,0x66,0x28,0xd9,0x24,0xb2,0x76,0x5b,0xa2,0x49,0x6d,0x8b,0xd1,0x25,
  0x72,0xf8,0xf6,0x64,0x86,0x68,0x98,0x16,0xd4,0xa4,0x5c,0xcc,0x5d,0x65,0xb6,0x92,
  0x6c,0x70,0x48,0x50,0xfd,0xed,0xb9,0xda,0x5e,0x15,0x46,0x57,0xa7,0x8d,0x9d,0x84,
  0x90,0xd8,0xab,0x00,0x8c,0xbc,0xd3,0x0a,0xf7,0xe4,0x58,0x05,0xb8,0xb3,0x45,0x06,
  0xd0,0x2c,0x1e,0x8f,0xca,0x3f,0x0f,0x02,0xc1,0xaf,0xbd,0x03,0x01,0x13,0x8a,0x6b,
  0x3a,0x91,0x11,0x41,0x4f,0x67,0xdc,0xea,0x97,0xf2,0xcf,0xce,0xf0,0xb4,0xe6,0x73,
  0x96,0xac,0x74,0x22,0xe7,0xad,0x35,0x85,0xe2,0xf9,0x37,0xe8,0x1c,0x75,0xdf,0x6e,
  0x47,0xf1,0x1a,0x71,0x1d,0x29,0xc5,0x89,0x6f,0xb7,0x62,0x0e,0xaa,0x18,0xbe,0x1b,
  0xfc,0x56,0x3e,0x4b,0xc6,0xd2,0x79,0x20,0x9a,0xdb,0xc0,0xfe,0x78,0xcd,0x5a,0xf4,
  0x1f,0xdd,0xa8,0x33,0x88,0x07,0xc7,0x31,0xb1,0x12,0x10,0x59,0x27,0x80,0xec,0x5f,
  0x60,0x51,0x7f,0xa9,0x19,0xb5,0x4a,0x0d,0x2d,0xe5,0x7a,0x9f,0x93,0xc9,0x9c,0xef,
  0xa0,0xe0,0x3b,0x4d,0xae,0x2a,0xf5,0xb0,0xc8,0xeb,0xbb,0x3c,0x83,0x53,0x99,0x61,
  0x17,0x2b,0x04,0x7e,0xba,0x77,0xd6,0x26,0xe1,0x69,0x14,0x63,0x55,0x21,0x0c,0x7d
};

static const uint8_t rcon[11] =
{
  0x8d,0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80,0x1b,0x36
};

static uint8_t xtime(uint8_t x) { return (x << 1) ^ ((x >> 7) * 0x1b); }
static uint8_t mul(uint8_t x, uint8_t y)
{
  return ((y & 1) * x) ^
         ((y >> 1 & 1) * xtime(x)) ^
         ((y >> 2 & 1) * xtime(xtime(x))) ^
         ((y >> 3 & 1) * xtime(xtime(xtime(x)))) ^
         ((y >> 4 & 1) * xtime(xtime(xtime(xtime(x)))));
}

static void aes_key_expansion(const uint8_t *key, uint8_t rk[11][4][4])
{
  uint8_t tmp[4];
  int     i;

  for (i = 0; i < NK; i++)
    {
      rk[0][i][0] = key[4 * i];
      rk[0][i][1] = key[4 * i + 1];
      rk[0][i][2] = key[4 * i + 2];
      rk[0][i][3] = key[4 * i + 3];
    }

  for (i = NK; i < NB * (NR + 1); i++)
    {
      int prev_rnd = (i - 1) / NK;
      int prev_col = (i - 1) % NK;
      tmp[0] = rk[prev_rnd][prev_col][0];
      tmp[1] = rk[prev_rnd][prev_col][1];
      tmp[2] = rk[prev_rnd][prev_col][2];
      tmp[3] = rk[prev_rnd][prev_col][3];

      if (i % NK == 0)
        {
          uint8_t t = tmp[0];
          tmp[0] = sbox[tmp[1]] ^ rcon[i / NK];
          tmp[1] = sbox[tmp[2]];
          tmp[2] = sbox[tmp[3]];
          tmp[3] = sbox[t];
        }

      int cur_rnd = i / NK;
      int cur_col = i % NK;
      int src_rnd = (i - NK) / NK;
      int src_col = (i - NK) % NK;
      rk[cur_rnd][cur_col][0] = rk[src_rnd][src_col][0] ^ tmp[0];
      rk[cur_rnd][cur_col][1] = rk[src_rnd][src_col][1] ^ tmp[1];
      rk[cur_rnd][cur_col][2] = rk[src_rnd][src_col][2] ^ tmp[2];
      rk[cur_rnd][cur_col][3] = rk[src_rnd][src_col][3] ^ tmp[3];
    }
}


/****************************************************************************
 * Private Functions — AES Key Unwrap (RFC 3394)
 * Decrypts an AES-128 key-wrapped buffer in place.
 * Returns 0 on success, -1 if integrity check fails.
 ****************************************************************************/

/* We need AES decrypt for key unwrap */

static void aes_decrypt(const uint8_t *in, const uint8_t rk[11][4][4],
                         uint8_t *out)
{
  state_t state;
  int     round;
  int     r;
  int     c;

  for (r = 0; r < 4; r++)
    for (c = 0; c < 4; c++)
      state[r][c] = in[r + 4 * c];

  /* AddRoundKey NR */
  for (r = 0; r < 4; r++)
    for (c = 0; c < 4; c++)
      state[r][c] ^= rk[NR][c][r];

  for (round = NR - 1; round >= 0; round--)
    {
      /* InvShiftRows */
      uint8_t t;
      t = state[1][3]; state[1][3] = state[1][2]; state[1][2] = state[1][1];
      state[1][1] = state[1][0]; state[1][0] = t;
      t = state[2][0]; state[2][0] = state[2][2]; state[2][2] = t;
      t = state[2][1]; state[2][1] = state[2][3]; state[2][3] = t;
      t = state[3][0]; state[3][0] = state[3][1]; state[3][1] = state[3][2];
      state[3][2] = state[3][3]; state[3][3] = t;

      /* InvSubBytes */
      for (r = 0; r < 4; r++)
        for (c = 0; c < 4; c++)
          state[r][c] = rsbox[state[r][c]];

      /* AddRoundKey */
      for (r = 0; r < 4; r++)
        for (c = 0; c < 4; c++)
          state[r][c] ^= rk[round][c][r];

      /* InvMixColumns (skip first AddRoundKey, done above) */
      if (round > 0)
        {
          for (c = 0; c < 4; c++)
            {
              uint8_t s0 = state[0][c], s1 = state[1][c],
                      s2 = state[2][c], s3 = state[3][c];
              state[0][c] = mul(s0,0x0e)^mul(s1,0x0b)^mul(s2,0x0d)^mul(s3,0x09);
              state[1][c] = mul(s0,0x09)^mul(s1,0x0e)^mul(s2,0x0b)^mul(s3,0x0d);
              state[2][c] = mul(s0,0x0d)^mul(s1,0x09)^mul(s2,0x0e)^mul(s3,0x0b);
              state[3][c] = mul(s0,0x0b)^mul(s1,0x0d)^mul(s2,0x09)^mul(s3,0x0e);
            }
        }
    }

  for (r = 0; r < 4; r++)
    for (c = 0; c < 4; c++)
      out[r + 4 * c] = state[r][c];
}

static int aes_unwrap(const uint8_t *kek, uint32_t kek_len,
                      const uint8_t *cipher, uint32_t cipher_len,
                      uint8_t *plain)
{
  uint8_t rk[11][4][4];
  uint8_t a[8];
  uint8_t b[16];
  uint32_t n;
  int64_t  j;
  int      i;

  if (cipher_len < 16 || (cipher_len % 8) != 0)
    {
      return -1;
    }

  n = (cipher_len / 8) - 1;

  aes_key_expansion(kek, rk);

  memcpy(a, cipher, 8);
  memcpy(plain, cipher + 8, n * 8);

  for (j = 5; j >= 0; j--)
    {
      for (i = n; i >= 1; i--)
        {
          uint64_t t = (uint64_t)(n * (uint64_t)j + i);
          for (int k = 7; k >= 0; k--, t >>= 8)
            {
              a[k] ^= (uint8_t)(t & 0xff);
            }

          memcpy(b, a, 8);
          memcpy(b + 8, plain + (i - 1) * 8, 8);
          aes_decrypt(b, rk, b);
          memcpy(a, b, 8);
          memcpy(plain + (i - 1) * 8, b + 8, 8);
        }
    }

