mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
  /* Integrity check: A should be 0xa6a6a6a6a6a6a6a6 */

  for (i = 0; i < 8; i++)
    {
      if (a[i] != 0xa6)
        {
          return -1;
        }
    }

  return 0;
}

/****************************************************************************
 * Private Types — EAPOL frame
 ****************************************************************************/

/* Minimal EAPOL-Key frame layout (offsets from start of Ethernet payload) */

struct eapol_hdr
{
  uint8_t  version;
  uint8_t  type;     /* 3 = EAPOL-Key */
  uint16_t length;   /* BE, body length */
} __attribute__((packed));

struct eapol_key
{
  uint8_t  desc_type;     /* 2 = RSN */
  uint16_t key_info;      /* BE */
  uint16_t key_length;    /* BE */
  uint8_t  replay_cnt[8];
  uint8_t  nonce[32];
  uint8_t  key_iv[16];
  uint8_t  key_rsc[8];
  uint8_t  key_id[8];
  uint8_t  mic[16];
  uint16_t key_data_len;  /* BE */
  /* key_data follows */
} __attribute__((packed));

/****************************************************************************
 * Private Functions — Debug
 ****************************************************************************/

static void nrf7002_wpa_put_be16(uint8_t *pos, uint16_t val)
{
  pos[0] = (uint8_t)(val >> 8);
  pos[1] = (uint8_t)val;
}

static void nrf7002_wpa_hexdump(const char *label,
                                const uint8_t *data,
                                uint32_t len)
{
  static const char hex[] = "0123456789abcdef";
  char line[33];
  uint32_t off;

  for (off = 0; off < len; off += 16)
    {
      uint32_t chunk = len - off;
      uint32_t i;

      if (chunk > 16)
        {
          chunk = 16;
        }

      for (i = 0; i < chunk; i++)
        {
          line[2 * i]     = hex[data[off + i] >> 4];
          line[2 * i + 1] = hex[data[off + i] & 0x0f];
        }

      line[2 * chunk] = '\0';

      syslog(LOG_INFO, "nrf7002: WPA %s[%lu]=%s\n",
             label, (unsigned long)off, line);
    }
}

static enum nrf_wifi_status nrf7002_wpa_tx_eapol(struct nrf7002_priv *priv,
                                                 const uint8_t *frame,
                                                 uint32_t len)
{
  struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;
  enum nrf_wifi_status              status;
  unsigned char                    *ra;
  void                             *nbuf;
  uint16_t                          ethertype;
  int                               peer_id;
  int                               ret;

  if (priv == NULL || priv->fmac_dev_ctx == NULL || frame == NULL ||
      len < 14)
    {
      return NRF_WIFI_STATUS_FAIL;
    }

  ethertype = ((uint16_t)frame[12] << 8) | frame[13];
  if (ethertype != EAPOL_ETHERTYPE)
    {
      syslog(LOG_ERR, "nrf7002: refusing non-EAPOL control TX type=0x%04x\n",
             ethertype);
      return NRF_WIFI_STATUS_FAIL;
    }

  if (!priv->carrier_up)
    {
      syslog(LOG_ERR, "nrf7002: EAPOL TX blocked: carrier down\n");
      return NRF_WIFI_STATUS_FAIL;
    }

  nbuf = nrf_wifi_osal_nbuf_alloc(len + NRF7002_TX_NBUF_HEADROOM);
  if (nbuf == NULL)
    {
      syslog(LOG_ERR, "nrf7002: EAPOL nbuf alloc FAILED\n");
      return NRF_WIFI_STATUS_FAIL;
    }

  nrf_wifi_osal_nbuf_headroom_res(nbuf, NRF7002_TX_NBUF_HEADROOM);
  nrf_wifi_osal_nbuf_data_put(nbuf, len);
  memcpy(nrf_wifi_osal_nbuf_data_get(nbuf), frame, len);

  sys_dev_ctx = wifi_dev_priv(priv->fmac_dev_ctx);
  if (sys_dev_ctx == NULL || sys_dev_ctx->vif_ctx[priv->vif_idx] == NULL)
    {
      syslog(LOG_ERR, "nrf7002: EAPOL TX blocked: missing vif context\n");
      nrf_wifi_osal_nbuf_free(nbuf);
      return NRF_WIFI_STATUS_FAIL;
    }

  ra = nrf_wifi_util_get_ra(sys_dev_ctx->vif_ctx[priv->vif_idx], nbuf);
  peer_id = nrf_wifi_fmac_peer_get_id(priv->fmac_dev_ctx, ra);
  if (peer_id == -1)
    {
      syslog(LOG_ERR, "nrf7002: EAPOL TX blocked: unknown peer\n");
      nrf_wifi_osal_nbuf_free(nbuf);
      return NRF_WIFI_STATUS_FAIL;
    }

  ret = nxsem_trywait(&priv->tx_tokens);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "nrf7002: EAPOL TX blocked: TX token busy\n");
      nrf_wifi_osal_nbuf_free(nbuf);
      return NRF_WIFI_STATUS_FAIL;
    }

  status = nrf_wifi_fmac_start_xmit(priv->fmac_dev_ctx, priv->vif_idx, nbuf);

  /* On failure, nrf_wifi_fmac_start_xmit() has already freed nbuf. */

  nxsem_post(&priv->tx_tokens);

  return status;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/**
 * nrf7002_wpa_derive_pmk - Derive PMK from passphrase and SSID
 */
void nrf7002_wpa_derive_pmk(const char *passphrase,
                             const uint8_t *ssid, uint32_t ssid_len,
                             uint8_t pmk[32])
{
  pbkdf2_sha1(passphrase, ssid, ssid_len, 4096, pmk, 32);
}

/**
 * nrf7002_wpa_process_eapol - Handle incoming EAPOL frame for 4-way HS
 *
 * Called from nrf7002_rx_worker for ethertype 0x888E frames.
 * Returns true if frame was consumed (EAPOL-Key), false otherwise.
 */
bool nrf7002_wpa_process_eapol(struct nrf7002_priv *priv,
                                const uint8_t *frame, uint32_t len)
{
  const struct eapol_hdr *ehdr;
  const struct eapol_key *ekey;

  uint16_t            key_info;
  bool                is_pairwise;
  bool                has_mic;
  bool                is_msg1;
  bool                is_msg3;
  bool                new_handshake;
  const uint8_t      *kdata;
  uint32_t            kdata_len;
  uint8_t             gtk[32];
  uint8_t             mic_computed[20];
  uint8_t             prf_data[2 * 6 + 2 * 32]; /* two MACs + two nonces */
  struct nrf_wifi_umac_key_info key_info_fmac;
  enum nrf_wifi_status fmac_st;

  if (len < 14 + sizeof(*ehdr) + sizeof(*ekey))
    {
      return false;
    }

  if (((uint16_t)frame[12] << 8 | frame[13]) != EAPOL_ETHERTYPE)
    {
      return false;
    }

  /* Use byte offsets to avoid Cortex-M33 alignment faults on packed fields */

  /* EAPOL header: [ver][type][len_hi][len_lo] at frame+14 */

  uint8_t eapol_type = frame[14 + 1];  /* type field */

