mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
  if (eapol_type != 3)
    {
      return false; /* Not EAPOL-Key */
    }

  if (len < 14 + 4 + sizeof(*ekey))
    {
      syslog(LOG_WARNING, "nrf7002: EAPOL too short: %lu\n", (unsigned long)len);
      return false;
    }

  ehdr = (const struct eapol_hdr *)(frame + 14);
  ekey = (const struct eapol_key *)(frame + 14 + 4);

  /* key_info is big-endian in the frame */
  key_info = (uint16_t)(((const uint8_t *)&ekey->key_info)[0] << 8 |
                         ((const uint8_t *)&ekey->key_info)[1]);

  is_pairwise = (key_info & (1 << 3)) != 0;  /* bit 3 */
  has_mic     = (key_info & (1 << 8)) != 0;  /* bit 8 */
  is_msg1     = is_pairwise && !has_mic;
  is_msg3     = is_pairwise && has_mic && (key_info & (1 << 9));

  kdata_len = (uint32_t)(((const uint8_t *)&ekey->key_data_len)[0] << 8 |
                           ((const uint8_t *)&ekey->key_data_len)[1]);
  kdata = (const uint8_t *)ekey + sizeof(*ekey);

  if (!is_msg1 && !is_msg3)
    {
      syslog(LOG_INFO, "nrf7002: EAPOL not M1/M3, skip\n");
      return false;
    }

  if (priv->pmk_valid == 0)
    {
      syslog(LOG_WARNING, "nrf7002: EAPOL but PMK not set\n");
      return true;
    }

  if (is_msg1)
    {
      /* M1: AP→STA, contains Anonce.
       * Generate Snonce, derive PTK.
       */

      syslog(LOG_INFO, "nrf7002: 4-way M1 received\n");
      syslog(LOG_INFO, "nrf7002: M1 key_info=0x%04x desc_ver=%u\n",
             key_info, (unsigned int)(key_info & 0x0007));

      if ((key_info & 0x0007) != 2)
        {
          syslog(LOG_WARNING,
                 "nrf7002: unsupported M1 desc_ver=%u; M2 uses ver=2 HMAC-SHA1/AES\n",
                 (unsigned int)(key_info & 0x0007));
        }

      /* New handshake instance — keys not yet installed for this round. */

      priv->keys_installed = 0;

      /* Generate SNonce only when this is a *new* handshake (ANonce changed).
       * If the AP retransmits M1 with the same ANonce (because it did not get
       * our M2 in time), we MUST reuse the same SNonce so the PTK stays
       * identical and M2's MIC verifies on the AP — otherwise the AP keeps
       * resending M1 and eventually deauths.  Per IEEE 802.11 / wpa_supplicant
       * the SNonce is only renewed for a genuinely new 4-way handshake.
       */

      new_handshake = !priv->ptk_valid ||
                      memcmp(priv->anonce, ekey->nonce, 32) != 0;
      if (new_handshake)
        {
          arc4random_buf(priv->snonce, sizeof(priv->snonce));
          syslog(LOG_INFO, "nrf7002: generated fresh SNonce\n");
        }
      else
        {
          syslog(LOG_INFO, "nrf7002: reusing SNonce for M1 retry\n");
        }

      /* Save Anonce */

      memcpy(priv->anonce, ekey->nonce, 32);
      memcpy(priv->ap_replay, ekey->replay_cnt, 8);

      /* Derive PTK: PRF-512(PMK, "Pairwise key expansion",
       *   min(AP_MAC,STA_MAC) || max(AP_MAC,STA_MAC) ||
       *   min(Anonce,Snonce)  || max(Anonce,Snonce))
       */

      const uint8_t *mac_ap  = priv->target_bssid;
      const uint8_t *mac_sta = priv->netdev.d_mac.ether.ether_addr_octet;
      const char    *mac_first;
      const char    *mac_second;
      const char    *nonce_first;
      const char    *nonce_second;

      /* min/max of MACs */
      if (memcmp(mac_ap, mac_sta, 6) < 0)
        {
          memcpy(prf_data,     mac_ap,  6);
          memcpy(prf_data + 6, mac_sta, 6);
          mac_first  = "AP";
          mac_second = "STA";
        }
      else
        {
          memcpy(prf_data,     mac_sta, 6);
          memcpy(prf_data + 6, mac_ap,  6);
          mac_first  = "STA";
          mac_second = "AP";
        }

      /* min/max of nonces */
      if (memcmp(priv->anonce, priv->snonce, 32) < 0)
        {
          memcpy(prf_data + 12, priv->anonce, 32);
          memcpy(prf_data + 44, priv->snonce, 32);
          nonce_first  = "ANonce";
          nonce_second = "SNonce";
        }
      else
        {
          memcpy(prf_data + 12, priv->snonce, 32);
          memcpy(prf_data + 44, priv->anonce, 32);
          nonce_first  = "SNonce";
          nonce_second = "ANonce";
        }

      syslog(LOG_INFO, "nrf7002: PTK PRF order mac=%s,%s nonce=%s,%s\n",
             mac_first, mac_second, nonce_first, nonce_second);
      nrf7002_wpa_hexdump("PTK-PRF-MAC0", prf_data, 6);
      nrf7002_wpa_hexdump("PTK-PRF-MAC1", prf_data + 6, 6);
      nrf7002_wpa_hexdump("PTK-PRF-NONCE0", prf_data + 12, 32);
      nrf7002_wpa_hexdump("PTK-PRF-NONCE1", prf_data + 44, 32);

      prf(priv->pmk, 32,
          "Pairwise key expansion", 22,
          prf_data, 76,
          priv->ptk, 64);

      priv->ptk_valid = 1;

      nrf7002_wpa_hexdump("ANonce", priv->anonce, 32);
      nrf7002_wpa_hexdump("SNonce", priv->snonce, 32);
      nrf7002_wpa_hexdump("PMK", priv->pmk, 32);
      nrf7002_wpa_hexdump("PTK-KCK", priv->ptk, 16);

      syslog(LOG_INFO, "nrf7002: PTK derived\n");

      /* Build M2 response.
       * M2: STA→AP, contains Snonce + RSN IE, MIC over entire frame.
       * NCS sends EAPOL through the data TX API, with the EAPOL ethertype
       * and assoc_info.control_port enabled, not through mgmt_tx.
       */

      nrf7002_wpa_send_m2(priv);
    }
  else if (is_msg3)
    {
      /* M3: AP→STA, contains encrypted GTK in key_data.
       *
       * Latency-critical path: the AP arms a 100 ms timeout waiting for M4.
       * If M4 is late the AP retransmits M3 with a higher replay counter and
       * the handshake degrades.  So this path must be as fast as possible:
       * NO syslog before M4 is on the wire, and keys are installed only once.
       */

      clock_t m3_t0 = clock_systime_ticks();

      if (!priv->ptk_valid)
        {
          syslog(LOG_WARNING, "nrf7002: M3 but PTK not valid\n");
          return true;
        }

      /* Verify ANonce in M3 matches the ANonce from M1.
       * Per wpa_supplicant process_3_of_4: the AP reuses the M1 ANonce in M3.
       */

      if (memcmp(ekey->nonce, priv->anonce, 32) != 0)
        {
          syslog(LOG_WARNING, "nrf7002: M3 ANonce != M1 — dropping\n");
          return true;
        }

      /* Verify MIC using KCK = ptk[0..15].
       * MIC = HMAC-SHA1(KCK, EAPOL frame with MIC field zeroed)[0..15].
       */

      uint32_t eapol_frame_len = 4 + (uint32_t)ntohs(ehdr->length);
      uint8_t *tmp_frame = kmm_malloc(eapol_frame_len);
      if (tmp_frame == NULL)
        {
          return true;
        }

      memcpy(tmp_frame, frame + 14, eapol_frame_len);
      memset(tmp_frame + 4 + 1 + 2 + 2 + 8 + 32 + 16 + 8 + 8, 0, 16);
      hmac_sha1(priv->ptk, 16, tmp_frame, eapol_frame_len, mic_computed);
      kmm_free(tmp_frame);

      if (memcmp(mic_computed, ekey->mic, 16) != 0)
        {
          syslog(LOG_ERR, "nrf7002: M3 MIC mismatch\n");
          return true;
        }

      /* CRITICAL: send M4 FIRST (plaintext, before key install), with the
       * replay counter copied from THIS M3.  This must happen before any
       * slow operation (key install, syslog) so the AP receives M4 inside
       * its 100 ms window and does not retransmit M3.
       */

      nrf7002_wpa_send_m4(priv, ekey->replay_cnt);
      memcpy(priv->ap_replay, ekey->replay_cnt, 8);

      {
        clock_t m3_t1 = clock_systime_ticks();
        syslog(LOG_INFO, "nrf7002: M3->M4 took %lu ms\n",
               (unsigned long)TICK2MSEC(m3_t1 - m3_t0));
      }

