mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
      /* Install pairwise/group keys and authorize the port only once.
       * A retransmitted M3 (AP didn't get our first M4 in time) just needs
       * another M4 — re-installing keys would disturb the live link.
       */

      if (priv->keys_installed)
        {
          syslog(LOG_INFO, "nrf7002: M3 retransmit — re-sent M4 only\n");
          return true;
        }

      syslog(LOG_INFO, "nrf7002: M4 sent, installing keys\n");

      memset(&key_info_fmac, 0, sizeof(key_info_fmac));
      memcpy(key_info_fmac.key.nrf_wifi_key, priv->ptk + 32, 16);
      key_info_fmac.key.nrf_wifi_key_len = 16;
      key_info_fmac.cipher_suite         = 0x000fac04; /* CCMP */
      key_info_fmac.key_type             = NRF_WIFI_KEYTYPE_PAIRWISE;
      key_info_fmac.key_idx              = 0;
      key_info_fmac.valid_fields         = NRF_WIFI_CIPHER_SUITE_VALID |
                                            NRF_WIFI_KEY_VALID |
                                            NRF_WIFI_KEY_TYPE_VALID |
                                            NRF_WIFI_KEY_IDX_VALID;

      fmac_st = nrf_wifi_sys_fmac_add_key(priv->fmac_dev_ctx, priv->vif_idx,
                                           &key_info_fmac,
                                           (const char *)priv->target_bssid);
      if (fmac_st != NRF_WIFI_STATUS_SUCCESS)
        {
          syslog(LOG_ERR, "nrf7002: add PTK failed (%d)\n", (int)fmac_st);
        }
      else
        {
          syslog(LOG_INFO, "nrf7002: PTK installed\n");
        }

      /* Unwrap GTK from key_data (if encrypted) */

      if ((key_info & (1 << 12)) && kdata_len >= 16)
        {
          uint32_t plain_len = kdata_len - 8;
          uint8_t *plain = kmm_malloc(plain_len);
          int unwrap_ret = -1;
          if (plain)
            {
              unwrap_ret = aes_unwrap(priv->ptk + 16, 16, kdata, kdata_len, plain);
            }
          if (plain && unwrap_ret == 0)
            {
              /* Scan all KDEs in plain to find the GTK KDE.
               * M3 key_data may contain multiple packed KDEs, e.g.:
               *   RSN IE (tag=0x30) followed by GTK KDE (tag=0xdd).
               * Skip IEs (tag < 0xdd) and scan until GTK KDE found.
               *
               * KDE format: [0xdd][len][OUI 3B][type 1B][data...]
               * IE  format: [tag][len][data...]
               * GTK KDE OUI = 00-0f-ac, type = 01
               */

              uint32_t pos = 0;
              while (pos + 2 <= plain_len)
                {
                  uint8_t  tag = plain[pos];
                  uint8_t  elen = plain[pos + 1];

                  if (pos + 2 + elen > plain_len)
                    {
                      break;  /* truncated */
                    }

                  if (tag == 0xdd && elen >= 6 &&
                      plain[pos + 2] == 0x00 &&
                      plain[pos + 3] == 0x0f &&
                      plain[pos + 4] == 0xac &&
                      plain[pos + 5] == 0x01)
                    {
                      /* GTK KDE: [0xdd][len][00-0f-ac-01][key_id][rsc...][gtk] */

                      uint8_t  gtk_idx = plain[pos + 6] & 0x03;
                      uint32_t gtk_len = elen - 6;  /* subtract OUI+type+key_id+rsc */

                      /* The GTK is at plain[pos+8], length = elen-6 minus 1B rsc */
                      /* Layout: OUI(3) type(1) key_id(1) rsc(1) = 6 bytes overhead */
                      /* actual gtk starts at pos+8, length = elen - 6 */

                      if (gtk_len >= 8 && gtk_len <= 32)
                        {
                          memcpy(gtk, plain + pos + 8, gtk_len);

                          memset(&key_info_fmac, 0, sizeof(key_info_fmac));
                          memcpy(key_info_fmac.key.nrf_wifi_key, gtk, gtk_len);
                          key_info_fmac.key.nrf_wifi_key_len = gtk_len;
                          key_info_fmac.cipher_suite         = 0x000fac04;
                          key_info_fmac.key_type             = NRF_WIFI_KEYTYPE_GROUP;
                          key_info_fmac.key_idx              = gtk_idx;
                          key_info_fmac.nrf_wifi_flags       =
                            NRF_WIFI_KEY_DEFAULT_TYPE_MULTICAST;
                          key_info_fmac.valid_fields         =
                            NRF_WIFI_CIPHER_SUITE_VALID |
                            NRF_WIFI_KEY_VALID |
                            NRF_WIFI_KEY_TYPE_VALID |
                            NRF_WIFI_KEY_IDX_VALID;

                          fmac_st = nrf_wifi_sys_fmac_add_key(priv->fmac_dev_ctx,
                                                               priv->vif_idx,
                                                               &key_info_fmac,
                                                               NULL);
                          if (fmac_st != NRF_WIFI_STATUS_SUCCESS)
                            {
                              syslog(LOG_ERR, "nrf7002: add GTK failed (%d)\n",
                                     (int)fmac_st);
                            }
                          else
                            {
                              syslog(LOG_INFO, "nrf7002: GTK installed (idx=%u len=%lu)\n",
                                     gtk_idx, (unsigned long)gtk_len);
                            }
                        }
                      break;  /* found GTK KDE */
                    }

                  pos += 2 + elen;  /* advance to next KDE/IE */
                }
            }

          kmm_free(plain);
        }

      {
        bool port_authorized = false;

        /* Authorize the 802.1X controlled port.
         *
         * With control_port=1 in the assoc request, the RPU firmware holds
         * all non-EAPOL TX in an unauthorized state.  After PTK/GTK are
         * installed we must call SET_STATION with NRF_WIFI_STA_FLAG_AUTHORIZED
         * (bit 1) so the RPU opens the data port.  Without this the RPU
         * silently drops every non-EAPOL frame and the AP disconnects us
         * due to inactivity.
         */

        {
          struct nrf_wifi_umac_chg_sta_info chg_sta;
          enum nrf_wifi_status port_st;

