mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_wpa.c
          memset(&chg_sta, 0, sizeof(chg_sta));
          memcpy(chg_sta.mac_addr, priv->target_bssid,
                 NRF7002_MAC_ADDR_LEN);

          chg_sta.sta_flags2.nrf_wifi_mask = NRF_WIFI_STA_FLAG_AUTHORIZED;
          chg_sta.sta_flags2.nrf_wifi_set  = NRF_WIFI_STA_FLAG_AUTHORIZED;

          port_st = nrf_wifi_sys_fmac_chg_sta(priv->fmac_dev_ctx,
                                               priv->vif_idx,
                                               &chg_sta);
          if (port_st != NRF_WIFI_STATUS_SUCCESS)
            {
              syslog(LOG_ERR, "nrf7002: port_authorize failed (%d)\n",
                     (int)port_st);
            }
          else
            {
              struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;
              int peer_id;

              sys_dev_ctx = wifi_dev_priv(priv->fmac_dev_ctx);
              peer_id = nrf_wifi_fmac_peer_get_id(priv->fmac_dev_ctx,
                                                  priv->target_bssid);
              if (sys_dev_ctx != NULL && peer_id >= 0 && peer_id < MAX_PEERS)
                {
                  sys_dev_ctx->tx_config.peers[peer_id].authorized = true;
                }

              syslog(LOG_INFO, "nrf7002: port authorized - data TX enabled\n");
              port_authorized = true;
            }
        }

        /* Mark the handshake complete so a retransmitted M3 only re-sends M4
         * and does not re-install keys or re-authorize the port.
         */

        if (port_authorized)
          {
            priv->keys_installed = 1;
            syslog(LOG_INFO, "nrf7002: EAPOL-4WAY-HS-COMPLETED\n");
          }
      }
    }

  return true;
}

/**
 * nrf7002_wpa_send_m2 - Send EAPOL M2 (STA response to M1)
 */
void nrf7002_wpa_send_m2(struct nrf7002_priv *priv)
{
  /* M2: [eth_hdr(14)] [EAPOL hdr(4)] [eapol_key(95)] [RSN IE(22)] */

  static const uint8_t rsn_ie[] =
    {
      0x30, 0x14,
      0x01, 0x00,
      0x00, 0x0f, 0xac, 0x04,
      0x01, 0x00,
      0x00, 0x0f, 0xac, 0x04,
      0x01, 0x00,
      0x00, 0x0f, 0xac, 0x02,
      0x00, 0x00
    };

  uint32_t body_len = sizeof(struct eapol_key) + sizeof(rsn_ie);
  uint32_t total    = 14 + 4 + body_len;
  uint8_t *frame    = kmm_zalloc(total);
  uint8_t  mic[20];

  if (frame == NULL)
    {
      return;
    }

  /* Ethernet header */

  memcpy(frame,     priv->target_bssid, 6);  /* dst = AP */
  memcpy(frame + 6, priv->netdev.d_mac.ether.ether_addr_octet, 6);
  frame[12] = 0x88;
  frame[13] = 0x8e;

  /* EAPOL header */

  frame[14] = 0x02;  /* version 2 */
  frame[15] = 0x03;  /* EAPOL-Key */
  frame[16] = (uint8_t)((body_len >> 8) & 0xff);
  frame[17] = (uint8_t)(body_len & 0xff);

  /* EAPOL-Key */

  struct eapol_key *ek = (struct eapol_key *)(frame + 18);
  ek->desc_type = 2;  /* RSN */

  /* key_info: pairwise(3), MIC(8), version(bits 0-2)=2 (HMAC-SHA1-128+AES) */
  /* bit 0-2: version=2, bit 3=pairwise, bit 8=MIC */

  uint16_t ki = (2) | (1 << 3) | (1 << 8);
  uint8_t *ek_bytes = (uint8_t *)ek;

  nrf7002_wpa_put_be16(ek_bytes + 1, ki);

  /* hostap sends zero Key Length in RSN/WPA2 M2/M4 frames. */

  nrf7002_wpa_put_be16(ek_bytes + 3, 0);

  /* replay counter from M1 */
  memcpy(ek->replay_cnt, priv->ap_replay, 8);

  /* Snonce */
  memcpy(ek->nonce, priv->snonce, 32);

  /* key_data = RSN IE */
  nrf7002_wpa_put_be16(ek_bytes + sizeof(*ek) - 2, sizeof(rsn_ie));
  memcpy((uint8_t *)ek + sizeof(*ek), rsn_ie, sizeof(rsn_ie));

  /* Compute MIC = HMAC-SHA1(KCK, frame+14)[0..15] */

  hmac_sha1(priv->ptk, 16, frame + 14, 4 + body_len, mic);
  memcpy(ek->mic, mic, 16);
  nrf7002_wpa_hexdump("computed-MIC", ek->mic, 16);

  /* Transmit via the NCS control-port path: EAPOL ethertype over data
   * start_xmit with assoc_info.control_port enabled, not mgmt_tx.
   */

  {
    enum nrf_wifi_status st;

    st = nrf7002_wpa_tx_eapol(priv, frame, total);
    syslog(LOG_INFO, "nrf7002: M2 sent st=%d\n", (int)st);
  }

  kmm_free(frame);
}

/**
 * nrf7002_wpa_send_m4 - Send EAPOL M4 (confirms key installation)
 */
void nrf7002_wpa_send_m4(struct nrf7002_priv *priv,
                          const uint8_t replay_cnt[8])
{
  uint32_t body_len = sizeof(struct eapol_key);
  uint32_t total    = 14 + 4 + body_len;
  uint8_t *frame    = kmm_zalloc(total);
  uint8_t  mic[20];

  if (frame == NULL)
    {
      return;
    }

  /* Ethernet header */

  memcpy(frame,     priv->target_bssid, 6);
  memcpy(frame + 6, priv->netdev.d_mac.ether.ether_addr_octet, 6);
  frame[12] = 0x88;
  frame[13] = 0x8e;

  /* EAPOL header */

  frame[14] = 0x02;
  frame[15] = 0x03;
  frame[16] = (uint8_t)((body_len >> 8) & 0xff);
  frame[17] = (uint8_t)(body_len & 0xff);

  /* EAPOL-Key: pairwise, secure, MIC set */

  struct eapol_key *ek = (struct eapol_key *)(frame + 18);
  ek->desc_type = 2;

  uint16_t ki = (2) | (1 << 3) | (1 << 8) | (1 << 9);
  uint8_t *ek_bytes = (uint8_t *)ek;

  nrf7002_wpa_put_be16(ek_bytes + 1, ki);
  nrf7002_wpa_put_be16(ek_bytes + 3, 0);

  memcpy(ek->replay_cnt, replay_cnt, 8);

  /* Compute MIC */

  hmac_sha1(priv->ptk, 16, frame + 14, 4 + body_len, mic);
  memcpy(ek->mic, mic, 16);

  {
    enum nrf_wifi_status st;

    st = nrf7002_wpa_tx_eapol(priv, frame, total);
    syslog(LOG_INFO, "nrf7002: M4 sent st=%d\n", (int)st);
  }

  kmm_free(frame);
}
